---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RouteAnalysisSettingsParam
source: html/63ee71d5-b0cb-9cba-eb41-4cb14b3bb06f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RouteAnalysisSettingsParam Property

"Route Analysis Settings"

## Syntax (C#)
```csharp
public static ForgeTypeId RouteAnalysisSettingsParam { get; }
```